In [554]:
from sqlalchemy import create_engine
import pandas as pd
from time import time

In [555]:
conn = create_engine('postgresql://root:root@localhost:5432/online_retail')

In [556]:
clean_data_query = 'SELECT * FROM retail_cleaned_data'

In [557]:
df_clean = pd.read_sql(clean_data_query, con=conn)

In [558]:
df_clean_date = pd.DataFrame({
    'year': df_clean['InvoiceDate'].dt.year,
    'month': df_clean['InvoiceDate'].dt.month,
    'monthname': df_clean['InvoiceDate'].dt.month_name(),
    'quater': df_clean['InvoiceDate'].dt.quarter,
    'quatername': 'Q' + df_clean['InvoiceDate'].dt.quarter.astype(str),
    'day': df_clean['InvoiceDate'].dt.day,
    'dayname': df_clean['InvoiceDate'].dt.day_name(),
    'week': df_clean['InvoiceDate'].dt.isocalendar().week,
    'hour': df_clean['InvoiceDate'].dt.hour,
    'minute': df_clean['InvoiceDate'].dt.minute,
}).drop_duplicates()

In [559]:
df_clean_date

,year,month,monthname,quater,quatername,day,dayname,week,hour,minute
0,2010,12,December,4,Q4,1,Wednesday,48,8,26
3,2010,12,December,4,Q4,1,Wednesday,48,8,28
5,2010,12,December,4,Q4,1,Wednesday,48,8,34
21,2010,12,December,4,Q4,1,Wednesday,48,8,35
22,2010,12,December,4,Q4,1,Wednesday,48,8,45
...,...,...,...,...,...,...,...,...,...,...
366135,2011,12,December,4,Q4,9,Friday,49,12,23
366137,2011,12,December,4,Q4,9,Friday,49,12,25
366139,2011,12,December,4,Q4,9,Friday,49,12,31
366160,2011,12,December,4,Q4,9,Friday,49,12,49
366164,2011,12,December,4,Q4,9,Friday,49,12,50

In [560]:
dateQuery = """
SELECT year, month, monthname, quater, quatername, day, dayname, week, hour, minute FROM "DimMonth"
"""

In [561]:
dimDate = pd.read_sql(dateQuery, con=conn)

In [562]:
dimDate

,year,month,monthname,quater,quatername,day,dayname,week,hour,minute
0,2010,12,December,4,Q4,1,Wednesday,48,8,26
1,2010,12,December,4,Q4,1,Wednesday,48,8,28
2,2010,12,December,4,Q4,1,Wednesday,48,8,34
3,2010,12,December,4,Q4,1,Wednesday,48,8,35
4,2010,12,December,4,Q4,1,Wednesday,48,8,45
...,...,...,...,...,...,...,...,...,...,...
19839,2011,12,December,4,Q4,9,Friday,49,12,23
19840,2011,12,December,4,Q4,9,Friday,49,12,25
19841,2011,12,December,4,Q4,9,Friday,49,12,31
19842,2011,12,December,4,Q4,9,Friday,49,12,49
19843,2011,12,December,4,Q4,9,Friday,49,12,50

In [563]:
merged_df = df_clean_date.merge(dimDate, on=['year', 'month', 'monthname', 'quater', 'quatername', 'day', 'dayname', 'week', 'hour', 'minute'], how='left', indicator=True)

update_date = merged_df[merged_df['_merge'] == 'left_only'].drop(columns='_merge')

In [564]:
update_date

Empty DataFrame
Columns: [year, month, monthname, quater, quatername, day, dayname, week, hour, minute]
Index: []

In [565]:
dimDate_Id = pd.read_sql("""
SELECT max("monthId") From "DimMonth"
""", con=conn)

In [566]:
dimDate_Id

     max
0  19844

In [567]:
if dimDate_Id['max'][0] == None:
    update_date['monthId'] = range(1, len(update_date) + 1)
else:
    update_date['monthId'] = range(dimDate_Id['max'][0] + 1, len(update_date) + dimDate_Id['max'][0])

In [568]:
update_date

Empty DataFrame
Columns: [year, month, monthname, quater, quatername, day, dayname, week, hour, minute, monthId]
Index: []

In [569]:
update_date = update_date.set_index('monthId')

In [570]:
update_date

Empty DataFrame
Columns: [year, month, monthname, quater, quatername, day, dayname, week, hour, minute]
Index: []

In [571]:
start_time = time()
update_date.to_sql(name='DimMonth', con=conn, if_exists='append')
end_time = time()
time_diff = end_time - start_time
print(f"Successfully load data in DimMonth in {time_diff} seconds")

Successfully load data in DimMonth in 0.008108854293823242 seconds

In [572]:
df_clean_customer = pd.DataFrame({
    'customernumber': df_clean['CustomerID'],
    'country': df_clean['Country'] 
}).drop_duplicates()

In [573]:
df_clean_customer

        customernumber         country
0                17850  United Kingdom
5                13047  United Kingdom
22               12583          France
41               13748  United Kingdom
55               15100  United Kingdom
...                ...             ...
363396           13436  United Kingdom
363472           15520  United Kingdom
364160           13298  United Kingdom
364850           14569  United Kingdom
366046           12713         Germany

[4349 rows x 2 columns]

In [574]:
customerQuery = """
SELECT customernumber, country FROM "DimCustomer"
"""

In [575]:
dimCustomer = pd.read_sql(customerQuery, con=conn)

In [576]:
dimCustomer

      customernumber         country
0              17850  United Kingdom
1              13047  United Kingdom
2              12583          France
3              13748  United Kingdom
4              15100  United Kingdom
...              ...             ...
4344           13436  United Kingdom
4345           15520  United Kingdom
4346           13298  United Kingdom
4347           14569  United Kingdom
4348           12713         Germany

[4349 rows x 2 columns]

In [577]:
merged_df = df_clean_customer.merge(dimCustomer, on=['customernumber', 'country'], how='left', indicator=True)

update_customer = merged_df[merged_df['_merge'] == 'left_only'].drop(columns='_merge')

In [578]:
update_customer

Empty DataFrame
Columns: [customernumber, country]
Index: []

In [579]:
dimCustomer_Id = pd.read_sql("""
SELECT max("customerId") From "DimCustomer"
""", con=conn)

In [580]:
dimCustomer_Id

    max
0  4349

In [581]:
if dimCustomer_Id['max'][0] == None:
    update_customer['customerId'] = range(1, len(update_customer) + 1)
    update_customer['customername'] = ['Customer ' + str(i) for i in range(1, len(update_customer) + 1)]
else:
    update_customer['customerId'] = range(dimCustomer_Id['max'][0], len(update_customer) + dimCustomer_Id['max'][0])
    update_customer['customername'] = ['Customer ' + str(i) for i in range(dimCustomer_Id['max'][0], len(update_customer) + dimCustomer_Id['max'][0])]

In [582]:
update_customer

Empty DataFrame
Columns: [customernumber, country, customerId, customername]
Index: []

In [583]:
update_customer = update_customer.set_index('customerId')

In [584]:
update_customer

Empty DataFrame
Columns: [customernumber, country, customername]
Index: []

In [585]:
start_time = time()
update_customer.to_sql(name='DimCustomer', con=conn, if_exists='append')
end_time = time()
time_diff = end_time - start_time
print(f"Successfully load data in DimCustomer in {time_diff} seconds")

Successfully load data in DimCustomer in 0.006719350814819336 seconds

In [586]:
df_clean_stock = pd.DataFrame({
    'description': df_clean['Description'],
    'price': df_clean['UnitPrice'],
    'stockcode': df_clean['StockCode'],
}).drop_duplicates()

In [587]:
df_clean_stock

                              description  price stockcode
0                     WHITE METAL LANTERN   3.39     71053
1            SET 7 BABUSHKA NESTING BOXES   7.65     22752
2       GLASS STAR FROSTED T-LIGHT HOLDER   4.25     21730
3                  HAND WARMER UNION JACK   1.85     22633
4               HAND WARMER RED POLKA DOT   1.85     22632
...                                   ...    ...       ...
365418            WALL ART BICYCLE SAFETY   3.90     23535
365420              WALL ART DOG LICENCE    3.90     23526
365608     SET OF PICTURE FRAME  STICKERS   0.79     21253
365746        PAPER CRAFT , LITTLE BIRDIE   2.08     23843
365929               FORKED CACTUS CANDLE   1.25     20936

[7290 rows x 3 columns]

In [588]:
stockQuery = """
SELECT description, price, stockcode FROM "DimProduct"
"""

In [589]:
dimStock = pd.read_sql(stockQuery, con=conn)

In [590]:
dimStock

                            description  price  stockcode
0                   WHITE METAL LANTERN   3.39      71053
1          SET 7 BABUSHKA NESTING BOXES   7.65      22752
2     GLASS STAR FROSTED T-LIGHT HOLDER   4.25      21730
3                HAND WARMER UNION JACK   1.85      22633
4             HAND WARMER RED POLKA DOT   1.85      22632
...                                 ...    ...        ...
7285            WALL ART BICYCLE SAFETY   3.90      23535
7286              WALL ART DOG LICENCE    3.90      23526
7287     SET OF PICTURE FRAME  STICKERS   0.79      21253
7288        PAPER CRAFT , LITTLE BIRDIE   2.08      23843
7289               FORKED CACTUS CANDLE   1.25      20936

[7290 rows x 3 columns]

In [591]:
df_clean_stock['stockcode'] = df_clean_stock['stockcode'].astype(int)
df_clean_stock

                              description  price  stockcode
0                     WHITE METAL LANTERN   3.39      71053
1            SET 7 BABUSHKA NESTING BOXES   7.65      22752
2       GLASS STAR FROSTED T-LIGHT HOLDER   4.25      21730
3                  HAND WARMER UNION JACK   1.85      22633
4               HAND WARMER RED POLKA DOT   1.85      22632
...                                   ...    ...        ...
365418            WALL ART BICYCLE SAFETY   3.90      23535
365420              WALL ART DOG LICENCE    3.90      23526
365608     SET OF PICTURE FRAME  STICKERS   0.79      21253
365746        PAPER CRAFT , LITTLE BIRDIE   2.08      23843
365929               FORKED CACTUS CANDLE   1.25      20936

[7290 rows x 3 columns]

In [592]:
merged_df = df_clean_stock.merge(dimStock, on=['description', 'price', 'stockcode'], how='left', indicator=True)

update_stock = merged_df[merged_df['_merge'] == 'left_only'].drop(columns='_merge')

In [593]:
update_stock

Empty DataFrame
Columns: [description, price, stockcode]
Index: []

In [594]:
dimStock_Id = pd.read_sql("""
SELECT max("productId") From "DimProduct"
""", con=conn)

In [595]:
dimStock_Id

    max
0  7290

In [596]:
if dimStock_Id['max'][0] == None:
    update_stock['productId'] = range(1, len(update_stock) + 1)
else:
    update_stock['productId'] = range(dimStock_Id['max'][0] + 1, len(update_stock) + dimStock_Id['max'][0])

In [597]:
update_stock = update_stock.set_index('productId')

In [598]:
update_stock

Empty DataFrame
Columns: [description, price, stockcode]
Index: []

In [599]:
start_time = time()
update_stock.to_sql(name='DimProduct', con=conn, if_exists='append')
end_time = time()
time_diff = end_time - start_time
print(f"Successfully load data in DimCustomer in {time_diff} seconds")

Successfully load data in DimCustomer in 0.009967803955078125 seconds

In [600]:
clean_data_fact_query = """
SELECT rcd."Quantity", rcd."UnitPrice", 
rcd."InvoiceNo", rcd."InvoiceDate", 
rcd."StockCode", rcd."Description", 
rcd."CustomerID", rcd."Country", 
DimProduct."productId", dat."monthId",
DimCustomer."customerId"
FROM retail_cleaned_data AS rcd
INNER JOIN "DimMonth" AS dat
ON TO_TIMESTAMP(CONCAT(dat.year, '-', dat.month, '-', dat.day, ' ', dat.hour, ':', dat.minute), 'YYYY-MM-DD HH24:MI')  = rcd."InvoiceDate"
INNER JOIN "DimCustomer" AS DimCustomer 
ON DimCustomer.customernumber = rcd."CustomerID"
AND DimCustomer.country = rcd."Country"
INNER JOIN "DimProduct" AS DimProduct
ON DimProduct.stockcode::text = rcd."StockCode"
AND DimProduct.description = rcd."Description"
AND DimProduct.price = rcd."UnitPrice"

"""

In [601]:
clean_data_fact = pd.read_sql(clean_data_fact_query, con=conn)

In [602]:
clean_data_fact

,Quantity,UnitPrice,InvoiceNo,InvoiceDate,StockCode,Description,CustomerID,Country,productId,monthId,customerId
0,48,0.19,581001,2011-12-07 08:07:00,22540,MINI JIGSAW CIRCUS PARADE,12583,France,7168,19587,3
1,6,2.89,581001,2011-12-07 08:07:00,23562,SET OF 6 RIBBONS PERFECTLY PRETTY,12583,France,6929,19587,3
2,48,0.19,581001,2011-12-07 08:07:00,22544,MINI JIGSAW SPACEBOY,12583,France,7153,19587,3
3,32,3.75,581001,2011-12-07 08:07:00,23480,MINI LIGHTS WOODLAND MUSHROOMS,12583,France,6468,19587,3
4,6,2.08,581001,2011-12-07 08:07:00,23515,EMBROIDERED RIBBON REEL DAISY,12583,France,5689,19587,3
...,...,...,...,...,...,...,...,...,...,...,...
366174,12,0.42,580504,2011-12-04 13:32:00,22713,CARD I LOVE LONDON,17936,United Kingdom,510,19319,4320
366175,12,0.42,580504,2011-12-04 13:32:00,21509,COWBOYS AND INDIANS BIRTHDAY CARD,17936,United Kingdom,850,19319,4320
366176,25,0.42,580504,2011-12-04 13:32:00,22710,WRAP I LOVE LONDON,17936,United Kingdom,1820,19319,4320
366177,2,8.25,580504,2011-12-04 13:32:00,23284,DOORMAT KEEP CALM AND COME IN,17936,United Kingdom,5286,19319,4320
366178,1,1.25,580504,2011-12-04 13:32:00,20963,APPLE BATH SPONGE,17936,United Kingdom,240,19319,4320

In [603]:
df_clean_sales = pd.DataFrame({
    'quantity': clean_data_fact['Quantity'],
    'amount': clean_data_fact['UnitPrice'] * clean_data_fact['Quantity'],
    'invoiceNo': clean_data_fact['InvoiceNo'],
    'productId': clean_data_fact['productId'],
    'customerId': clean_data_fact['customerId'],
     'monthId': clean_data_fact['monthId'],
    'invoicedate': clean_data_fact['InvoiceDate'],
    'stockcode': clean_data_fact['StockCode'],
    'price': clean_data_fact['UnitPrice'],
    'description': clean_data_fact['Description'],
    'customernumber': clean_data_fact['CustomerID'],
    'country': clean_data_fact['Country']
    
}).drop_duplicates()

In [604]:
df_clean_sales

,quantity,amount,invoiceNo,productId,customerId,monthId,invoicedate,stockcode,price,description,customernumber,country
0,48,9.12,581001,7168,3,19587,2011-12-07 08:07:00,22540,0.19,MINI JIGSAW CIRCUS PARADE,12583,France
1,6,17.34,581001,6929,3,19587,2011-12-07 08:07:00,23562,2.89,SET OF 6 RIBBONS PERFECTLY PRETTY,12583,France
2,48,9.12,581001,7153,3,19587,2011-12-07 08:07:00,22544,0.19,MINI JIGSAW SPACEBOY,12583,France
3,32,120.00,581001,6468,3,19587,2011-12-07 08:07:00,23480,3.75,MINI LIGHTS WOODLAND MUSHROOMS,12583,France
4,6,12.48,581001,5689,3,19587,2011-12-07 08:07:00,23515,2.08,EMBROIDERED RIBBON REEL DAISY,12583,France
...,...,...,...,...,...,...,...,...,...,...,...,...
366174,12,5.04,580504,510,4320,19319,2011-12-04 13:32:00,22713,0.42,CARD I LOVE LONDON,17936,United Kingdom
366175,12,5.04,580504,850,4320,19319,2011-12-04 13:32:00,21509,0.42,COWBOYS AND INDIANS BIRTHDAY CARD,17936,United Kingdom
366176,25,10.50,580504,1820,4320,19319,2011-12-04 13:32:00,22710,0.42,WRAP I LOVE LONDON,17936,United Kingdom
366177,2,16.50,580504,5286,4320,19319,2011-12-04 13:32:00,23284,8.25,DOORMAT KEEP CALM AND COME IN,17936,United Kingdom
366178,1,1.25,580504,240,4320,19319,2011-12-04 13:32:00,20963,1.25,APPLE BATH SPONGE,17936,United Kingdom

In [605]:
df_clean_sales['stockcode'] = df_clean_sales['stockcode'].astype(int)

In [606]:
salesQuery = """
SELECT factsal.quantity, factsal.amount, factsal."invoiceNo", factsal.invoicedate, sto."productId", cus."customerId", dat."monthId", sto.stockcode, sto.price, sto.description, cus.customernumber, cus.country FROM "FactSales" AS factsal
INNER JOIN "DimProduct" AS sto
ON factsal."productId" = sto."productId"
INNER JOIN "DimCustomer" AS cus
ON factsal."customerId" = cus."customerId"
INNER JOIN "DimMonth" AS dat
ON factsal."monthId" = dat."monthId"
"""

In [607]:
factSales = pd.read_sql(salesQuery, con=conn)

In [608]:
factSales

,quantity,amount,invoiceNo,invoicedate,productId,customerId,monthId,stockcode,price,description,customernumber,country
0,48,9.12,581001,2011-12-07 08:07:00,7153,3,19587,22544,0.19,MINI JIGSAW SPACEBOY,12583,France
1,48,9.12,581001,2011-12-07 08:07:00,7168,3,19587,22540,0.19,MINI JIGSAW CIRCUS PARADE,12583,France
2,6,17.34,581001,2011-12-07 08:07:00,6929,3,19587,23562,2.89,SET OF 6 RIBBONS PERFECTLY PRETTY,12583,France
3,24,90.00,581001,2011-12-07 08:07:00,25,3,19587,22726,3.75,ALARM CLOCK BAKELIKE GREEN,12583,France
4,18,67.50,581001,2011-12-07 08:07:00,23,3,19587,22728,3.75,ALARM CLOCK BAKELIKE PINK,12583,France
...,...,...,...,...,...,...,...,...,...,...,...,...
366174,12,5.04,580504,2011-12-04 13:32:00,812,4320,19319,22816,0.42,CARD MOTORBIKE SANTA,17936,United Kingdom
366175,12,5.04,580504,2011-12-04 13:32:00,813,4320,19319,22818,0.42,CARD CHRISTMAS VILLAGE,17936,United Kingdom
366176,1,2.95,580504,2011-12-04 13:32:00,1405,4320,19319,22361,2.95,GLASS JAR DAISY FRESH COTTON WOOL,17936,United Kingdom
366177,1,1.95,580504,2011-12-04 13:32:00,7069,4320,19319,21115,1.95,ROSE CARAVAN DOORSTOP,17936,United Kingdom
366178,1,3.95,580504,2011-12-04 13:32:00,4402,4320,19319,23014,3.95,GLASS APOTHECARY BOTTLE ELIXIR,17936,United Kingdom

In [609]:
merged_df = df_clean_sales.merge(factSales, on=['quantity', 'amount', 'invoiceNo', 'invoicedate', 'productId', 'customerId', 'monthId', 'stockcode', 'price', 'description', 'customernumber', 'country'], how='left', indicator=True)

update_sales = merged_df[merged_df['_merge'] == 'left_only'].drop(columns='_merge')

In [610]:
update_sales

Empty DataFrame
Columns: [quantity, amount, invoiceNo, productId, customerId, monthId, invoicedate, stockcode, price, description, customernumber, country]
Index: []

In [611]:
factSales_Id = pd.read_sql("""
SELECT max("salesId") From "FactSales"
""", con=conn)

In [612]:
factSales_Id

      max
0  366179

In [620]:
update_sales.shape

(0, 7)

In [613]:
if factSales_Id['max'][0] == None:
    update_sales['salesId'] = range(1, len(update_sales) + 1)
else:
    update_sales['salesId'] = range(factSales_Id['max'][0] + 1, len(update_sales) + factSales_Id['max'][0])

In [614]:
update_sales

Empty DataFrame
Columns: [quantity, amount, invoiceNo, productId, customerId, monthId, invoicedate, stockcode, price, description, customernumber, country, salesId]
Index: []

In [615]:
update_sales = update_sales.set_index('salesId')

In [616]:
update_sales

Empty DataFrame
Columns: [quantity, amount, invoiceNo, productId, customerId, monthId, invoicedate, stockcode, price, description, customernumber, country]
Index: []

In [617]:
update_sales = update_sales.drop(columns=['stockcode', 'price', 'description', 'customernumber', 'country'])

In [618]:
update_sales

Empty DataFrame
Columns: [quantity, amount, invoiceNo, productId, customerId, monthId, invoicedate]
Index: []

In [619]:
start_time = time()
update_sales.to_sql(name='FactSales', con=conn, if_exists='append')
end_time = time()
time_diff = end_time - start_time
print(f"Successfully load data in FactSales in {time_diff} seconds")

Successfully load data in FactSales in 0.015580177307128906 seconds